 P0001: proc options(main);
     DCL 1 COMM_AREA,
        %INCLUDE Q0001;;

     DCL P0002          EXTERNAL ENTRY(POINTER);

     DCL TEST_STRING    CHAR(08);

     DCL SYSPRINT       FILE STREAM PRINT;
     DCL SYSIN          FILE STREAM INPUT;

     GET DATA(TEST_STRING);

     COMM_AREA.TEXT = TEST_STRING;

     CALL P0002(ADDR(COMM_AREA));

     PUT SKIP DATA (COMM_AREA.RETURN_CODE);
 END P0001;
