        Identification Division.
        Program-ID. COBTEST.
        WORKING-STORAGE SECTION.
        1 Abbruch-Code      pic 9(04) binary value 0.
        Procedure Division
      * Print Hello world        
DISP        Display "Hallo Welt!".
		    Write saldo-betr.
            STOP RUN.
