      ****************************************************************
      **           I D          D I V I S I O N                    ***
      ****************************************************************
       Identification Division.
       Program-id.    HELLOW.
      ****************************************************************
      **           D A T A      D I V I S I O N                    ***
      ****************************************************************
       Data Division.
       Working-Storage Section.

       Procedure Division.
            DISPLAY 'MINIMALISM'
            STOP RUN.
       End program HELLOW.
