 HELLOW: PROC OPTIONS(MAIN);
    DCL S0   CHAR(01) INIT(' ');
    DCL S1   CHAR(01) INIT(' ');

    EXEC SQL INCLUDE SQLCA;

    EXEC SQL
       SELECT IBMREQD
       INTO :S0, S1
       FROM SYSIBM.SYSDUMMY1;

    PUT SKIP LIST(S0, S1);


 END;
